[
  {
    "type": "MusicEvent",
    "startDate": "2025-01-23T04:00:00.000Z",
    "endDate": "2025-01-23T07:00:00.000Z",
    "url": "https://link.dice.fm/i34e91658ee1?dice_id=i34e91658ee1",
    "image": "https://dice-media.imgix.net/attachments/2024-12-20/cacdf285-6dc1-4197-8d57-32275b6d3ac2.jpg?rect=0%2C0%2C2018%2C2018",
    "name": "Rocco DeLuca, Harrison Whitford + special guests",
    "about": "**Rocco DeLuca** and **Harrison Whitford** will spend January 15th and January 22nd playing together, joined by special guests.\n\n$15 adv + DICE fees / $20 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-01-25T04:00:00.000Z",
    "endDate": "2025-01-25T08:00:00.000Z",
    "url": "https://link.dice.fm/t49049f59328?dice_id=t49049f59328",
    "image": "https://dice-media.imgix.net/attachments/2024-12-31/70a51571-84fd-4c23-80b1-4187c3c306b2.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Modular: Jack Schoonover, Presstones, and more",
    "about": "**Jack Schoonover**, who makes eurorack modules and other things as **SetonixSynth**, will be showcasing his synthesizers at Healing Force of the Universe on Friday, January 24 with other artists: **Presstones**, **Robots are Red**, and **Macroplastics**, while he is in town for Buchla and Friends.\n\n$15 adv (+DICE fees)/$18 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-01-25T22:00:00.000Z",
    "endDate": "2025-01-26T02:00:00.000Z",
    "url": "https://link.dice.fm/X134cbd671dc?dice_id=X134cbd671dc",
    "image": "https://dice-media.imgix.net/attachments/2025-01-03/3b6c2bbd-ffd7-461c-84db-a24f55f9d190.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Simon Metzger Quartet",
    "about": "2024 Angel City Jazz Festival Young Artists Competition winners, **Simon Metzger Quartet**, featuring Simon Metzger, Graehem Guerin, Isaiah Harwood, and Kai Suzuki, play a free afternoon show at Healing Force of the Universe on January 25, 2025 at 2 PM.",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-01-26T04:00:00.000Z",
    "endDate": "2025-01-26T08:00:00.000Z",
    "url": "https://link.dice.fm/kf2e75fd3a57?dice_id=kf2e75fd3a57",
    "image": "https://dice-media.imgix.net/attachments/2024-12-31/9c7613b5-5584-4316-9c23-232e90fc4959.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Sonic Dreams: the Art and Music of Brian Cooper",
    "about": "**Brian Cooper**, known as “**Earth Like Planets**,” is an LA-based solo artist blending sequenced synthesizers, vocals reminiscent of Ian McCulloch or Brendan Perry, and echoey guitar. He released two full-length albums (2019, 2021) and two EPs (2012, 2014). His sound roots in indie rock and post-punk, with some performances featuring live musicians. Cooper's music is influenced by cognitive science research and has been played on college radio. He’s performed in venues across LA and beyond, including The Echo, Gold Diggers, SXSW, and festivals in Joshua Tree and Ojai.\n\nCooper, also a visual artist, explores consciousness and material reality through trompe l’oeil techniques. His paintings combine elegance, humor, and philosophy, focusing on mind-body relationships, space, and modernity. His recent works depict abstracted bodies and obsolete phone book pages, inspired by Max Weber's theory of modernity. His art has been featured in publications like Juxtapoz, L.A. Weekly, and Hi Fructose, and exhibited in galleries worldwide. Cooper holds an MFA from USC and a BFA from the San Francisco Art Institute. He currently resides in Los Angeles.\n\nWe will be screening ***Sonic Dreams***, a documentary directed by Antony Berrios that explores the creative mind of Brian Cooper and the mesmerizing synergy between his music and painting.\n\nFilm screening and performances by LFZ and Earth Like Planets\n\n$15 adv (+DICE fees)/$18 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-01-26T22:00:00.000Z",
    "endDate": "2025-01-27T02:00:00.000Z",
    "url": "https://link.dice.fm/Jd9488df12de?dice_id=Jd9488df12de",
    "image": "https://dice-media.imgix.net/attachments/2025-01-03/258dc03f-6c23-42a4-b093-dc9140a5361f.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Katie Pearlman",
    "about": "**Katie Pearlman** says what women think but are too afraid to say out loud. With the release of her latest EP, *Horny Desert Folk,* Pearlman explores themes of femininity, defiance, and intuition, set to a lush soundscape that mixes elements of folk, indie, and alternative.\n\nBorn in LA, Pearlman spent her formative years performing music and studying philosophy in New Orleans where the performer in her soul was awoken. There she developed her piano and guitar skills while fronting a live band singing in clubs and at jazz festivals. After returning home from college, Pearlman found success as a songwriter penning Grammy-nominated songs for Kelly Clarkson, Grace Potter, and others accumulating over 120 million streams as a featured artist, in addition to lending her vocals to artists like Gryffin, Dijon, and Lukas Graham.\n\nPushing the boundaries with both her music and lifestyle, Katie found inspiration in the community she created after moving to Taos, New Mexico, and in the divine feminine energy from influences such as Patti Smith, Joni Mitchell, and Alanis Morissette. “I follow the cosmic feeling,” says Katie. “I’m designing my own life. I want to grow. And I want to make people feel less alone. A pioneer on the journey of coming home to yourself, Katie Pearlman is following her magic.\n\nFree hometown EP release show in the afternoon at 2 PM.",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-01-27T04:00:00.000Z",
    "endDate": "2025-01-27T07:00:00.000Z",
    "url": "https://link.dice.fm/vcf2d16b35cb?dice_id=vcf2d16b35cb",
    "image": "https://dice-media.imgix.net/attachments/2025-01-07/b67766f3-1870-4a4e-9755-a705e6d2a492.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Holy Matter, M.A. Tiesenga, LéPonds",
    "about": "**Holy Matter** is Leanna Kaiser, a musician, experimental filmmaker, and music video creator. Her first show as Holy Matter found her opening for Weyes Blood. After touring in various bands, she began studying experimental film, scoring her own films, and eventually moving to Los Angeles to study at CalArts’ prestigious MFA Program in Film/Video. During her time at CalArts, she became further interested in recording, eventually coming to manage the film school's recording studio. Her debut album *“Beauty Looking Back”* was released in Oct 2024 via Royal Oakie Records.\n\n**M.A. Tiesenga** is an artist whose practice delves into the intricate interplay of procedure and enaction within collaborative performance contexts, deftly shaping these dynamics through various idioms. Inspired by an affinity for the outdoors, Tiesenga draws analogies between these concepts and the art of cartography, illuminating the parallels between a map and a musical score.\n\n**LéPonds** is the project of Lisa Houdei, an experimental folk singer-songwriter based in Topanga Canyon. Her vocal approaches are haunting, angelic, and whimsical– with song styles akin to Vashti Bunyan and Norma Tanega. Her music is original, organic, and effortlessly beautiful. With four albums released, you will find many treasures– some, unexpected. She has opened for artists such as Jeff Tweedy, Natalie Prass, Black Belt Eagle Scout & has recently supported Haley Heynderickx on tour.\n\n$15 adv / $18 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-01-30T04:00:00.000Z",
    "endDate": "2025-01-30T08:00:00.000Z",
    "url": "https://link.dice.fm/s37534e59a26?dice_id=s37534e59a26",
    "image": "https://dice-media.imgix.net/attachments/2024-12-31/ec93d34e-915b-47db-875f-e49a088f6901.jpg?rect=0%2C0%2C2018%2C2018",
    "name": "Jeff Parker",
    "about": "**Jeff Parker** is one of contemporary music's most versatile and innovative electric guitarists and composers, known for his work across genres including pop, rock, jazz, and experimental music. With over 40 years of experience, his compositions blend tradition and technology, improvisation and composition, and the familiar with the abstract. His extensive sonic palette includes sample-based technologies, analog and digital synthesis, and conventional and extended guitar techniques.\n\nA key figure in “The Modern Chicago Sound,” Parker is a longtime member of Tortoise and a founding member of Isotope 217˚ and Chicago Underground. His collaborations include artists such as Andrew Bird, Meshell Ndegeocello, Vijay Iyer, Yo La Tengo, and Makaya McCraven. Parker has released several critically acclaimed albums, including Suite For Max Brown (2020), which debuted at #1 on the Billboard Jazz Chart. He is also a producer, having worked on albums by Jeremy Cunningham, Paul Bryan, and Anteloper, and a film composer. An associate member of Chicago’s AACM since 1995, Parker received the United States Artist’s Fellowship in 2022.\n\n$20 adv (+DICE fees)/$25 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-01-31T04:00:00.000Z",
    "endDate": "2025-01-31T08:00:00.000Z",
    "url": "https://link.dice.fm/u78f1091ee63?dice_id=u78f1091ee63",
    "image": "https://dice-media.imgix.net/attachments/2025-01-02/caba0ac0-50e4-4041-aafb-4278d46569c9.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Trevor Beld Jimenez, Swimming Bell",
    "about": "**Trevor Beld Jimenez** is a husband, father and songwriter from Riverside, CA. He is 1 half of the duo Parting Lines and he has played drums and bass guitar for artists such as Kacey Johansing, Joel Jerome, and Fruit Bats. Trevor has also cowritten songs with bands such as Gospelbeach and Pearl Charles.\n\nNamed as one of the top ten artists to watch in New York City by NPR, (though now relocated to Los Angeles), **Swimming Bell** has been described as a \"folk-era Sharon Van Etten\" by MOJO Magazine and her new album 'Charlie' reveals songs \"rich and textured, offering light, dark, highs, lows and everything in between.\" (Far Out).\n\n$15 at the door or $12 if you bring a can of food.\n\nDoors at 8 PM.",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-02-01T04:00:00.000Z",
    "endDate": "2025-02-01T08:00:00.000Z",
    "url": "https://link.dice.fm/x1e42d919d7f?dice_id=x1e42d919d7f",
    "image": "https://dice-media.imgix.net/attachments/2025-01-03/9ead3130-0b02-46bb-8002-2ecb40e7ebf1.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Ziemba, Alpine Decline, Fragile Gang",
    "about": "**Ziemba**, the project of composer René Kladzyk, blends bold, unflinching pop with heartfelt ballads. Known for its dramatic, electrifying sound, Ziemba's 2021 album *Unsubtle Magic* explores grief during the holidays, while *True Romantic* (2020) offers bombastic power ballads. Kladzyk's work has been featured in TV shows like *Broad City* and *Difficult People* and performed at venues like MoMA PS1 and in Fez, Morocco.\n\nFormed in 2010 by Jonathan and Pauline Zeitlin, **Alpine Decline** began as an L.A. duo with a noisy, shoegaze-inspired sound. After moving to China, they experimented with synths and expanded their approach. By 2018's Return to Desolation Lake, they embraced dreamy, psychedelic pop. In 2021, the duo became a full band, crafting sunny, jangly indie pop with For the Betterment of Well People, marking a shift from their noise rock roots.\n\n**Fragile Gang** is: semi-bliss, aglow, chunked, diy, punk, soothing, stati-tune, heterogeneous, quiet, bedroom, violin, girl boy, lo-fi, ragged, classic rock, simple, emo-funk, lovedness, blues chant, traditional, buzzed-out, semi-bliss, power pop, harmonica, sun style, feel through, see through, riot feel, Los Angeles.\n\n$15 adv (+DICE fees)/$18 at the door.\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-02-08T04:00:00.000Z",
    "endDate": "2025-02-08T08:00:00.000Z",
    "url": "https://link.dice.fm/g7ddd97c7c6f?dice_id=g7ddd97c7c6f",
    "image": "https://dice-media.imgix.net/attachments/2024-12-29/814cc03c-32d1-4f7f-bcfe-2effc9324dea.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Eva Loona Smith, Rocko Wheeler",
    "about": "**Eva Loona Smith with Fine Folk**'s mission is to fuse genres and musical styles together from the inspiring roots of Folk music. The band believes unity is possible through music alone with the message it promotes and the community it creates. They believe in “Music for the people, by the people”. All of their music is recorded live in the studio, and their live shows are creative and diverse every time. The name \"Fine Folk\" is nearly a translation of their message, as it represents how by holding true to the unifying roots of folk music, people will be just fine.\n\nBorn in East Texas, **Rocko Wheeler** blends Americana, folk, and country, inspired by legends like John Prine and Townes Van Zandt. His music has taken him across the U.S., from small stages to Nashville’s iconic studios. His debut album, The Book of Rocko Wheeler, gained attention in Nashville and L.A., with \"The Ghost Got Loose\" becoming an anthem. Now based in L.A., Rocko performs at venues like Hotel Café and The Echo. His upcoming album, West Coast Gold, releases Spring 2025, chronicling his journey from Texas to L.A.\n\nDoors at 8 PM.\n\n$18 adv (+DICE fees)/$22 at the door",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-02-09T04:00:00.000Z",
    "endDate": "2025-02-09T07:00:00.000Z",
    "url": "https://link.dice.fm/y3890548000a?dice_id=y3890548000a",
    "image": "https://dice-media.imgix.net/attachments/2025-01-18/28e4e632-e657-4367-b94e-84684ca2a3a3.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Deloyd Elze, Adriana McCassim",
    "about": "**Deloyd Elze**, an artist, songwriter, and producer from the American South-East, is based in East Los Angeles. With his project \"*Redfisher,*\" Elze fuses organic and synthetic elements, blending pristine tones with gritty textures. His meticulous process includes stretching, smearing, and arranging patterns from improvisations and micro-compositions. Using tools like the OP-1, Hologram Microcosm, and Chase Bliss Genloss MKII, Elze crafts a diverse sound palette. Drawing from instruments like a 210ce Taylor and Fender Mustang Bass, he creates a unique sonic landscape that spans indie, hip hop, and electronic genres.\n\n**Adriana McCassim** is a Los Angeles based, Asheville NC raised songwriter with a depth of style and guttering genre range. Her songs take notes from 90’s alt-rock and lo-fi garage country. Adriana’s music is earnest with sharp plain spoken lyricism. “Touch”, the first single off her debut record, released October 4th, 2022. The track is produced by Ryan Pollie and mixed by Alex Farrar (Snail Mail, Wednesday, MJ Lenderman, Indigo De Souza) of Drop of Sun Studios.\n\n$15 adv + DICE fees / $18 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-02-28T04:00:00.000Z",
    "endDate": "2025-02-28T08:00:00.000Z",
    "url": "https://link.dice.fm/Ga6ad2487a2c?dice_id=Ga6ad2487a2c",
    "image": "https://dice-media.imgix.net/attachments/2025-01-18/a962faff-b284-48e5-ab23-d0cc7c70f2a3.jpg?rect=0%2C0%2C1200%2C1200",
    "name": "Brenda Carsey Birthday Bash",
    "about": "Happy birthday, **Brenda Carsey**! It's a Capricorn Extravaganza Birthday Bash!\n\nFeaturing BC Band + Special Guest performing covers by renowned Capricorns!\n\n\\+ a jam session featuring surprise L.A. all-star musicians and friends!\n\n\\+ burlesque by Miss Anna Morphic\n\nFeaturing:\n\nThe BC Band (Brenda Carsey on lead vocal and keys, Matt Brundrett on drums, Derrick Wong on bass, Abby Posner, and Jungwoo Change on guitar) + special guests performing a diverse set of epic covers by renowned Capricorns! \n\nDon't miss this unique one time only show and hang!\n\n**Brenda Carsey** is a Los Angeles-based vocalist, songwriter, multi-instrumentalist, and producer. Her music has been described as brilliant, timeless, playful, and larger-than-life R&B/Soul and Progressive Pop. Carsey delivers an engaging, energetic show, with her unmistakably unique sound rooted in the classic pop diaspora. Carsey’s voice is uninhibited with a virtuosic range, mixing a syrupy sweet sound with a beautiful soulful darkness. She will stop you in your tracks with poetic lyrics, fluid melodies, engaging chord progressions, funky rhythms, and a voice filled with passion and soul. She has recently released three new singles, \"Just Trying To Do My Thing\" \"Party's Over\" and \"I'm Sorry\" all from her much anticipated full-length album *Cognizance* (January 2023).\n\n$10 adv (+DICE fees)/$15 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-03-08T04:00:00.000Z",
    "endDate": "2025-03-08T07:00:00.000Z",
    "url": "https://link.dice.fm/R021dabcfa3d?dice_id=R021dabcfa3d",
    "image": "https://dice-media.imgix.net/attachments/2025-01-07/c5bf1874-f22f-4c00-9b12-4c07510163a5.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Hasco Enjoyments Album Release Celebration",
    "about": "**Hasco Enjoyments** invites you to celebrate the release of their new album *Wow!*\n\nLive music will start around 8:30 with a post-show hang.\n\n$10 adv / $13 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  },
  {
    "type": "MusicEvent",
    "startDate": "2025-03-14T03:00:00.000Z",
    "endDate": "2025-03-14T06:00:00.000Z",
    "url": "https://link.dice.fm/mc5e3cb539f1?dice_id=mc5e3cb539f1",
    "image": "https://dice-media.imgix.net/attachments/2024-11-30/5185fb07-5289-409f-b7a6-884965a60bdf.jpg?rect=0%2C0%2C2000%2C2000",
    "name": "Iain Matthews, Russ Tolman",
    "about": "A vital figure in the history of British folk, **Ian Matthews** (also billed as **Iain Matthews**) was a founding member of the pioneering U.K. folk-rock band Fairport Convention before he went on to found his own group, Matthews' Southern Comfort, and later moved on to a solo career. Matthews possesses a warm and expressive tenor voice and a talent for songwriting. While he drew from British folk traditions in his work, his greatest inspiration came from American country, folk, and roots music, and he blended their timeless themes with a hippie-fied pastoral feel that was warm and sweet or sorrowful, depending on the song. Though he would dabble in soft rock, power pop, and synth pop in the late '70s and early '80s, he always returned to the sun-dappled sound of the country-folk hybrid that was his trademark.\n\n**Russ Tolman** is a singer-songwriter and guitarist known for his work in the 1980s Paisley Underground with True West, whose dark, hypnotic sound set them apart from their peers. After leaving the band, he launched a successful solo career with albums like *Totem Poles and Glory Holes* and *Down In Earthquake Town*, collaborating with artists like Johnette Napolitano and Howe Gelb. His music blends folk, rock, and experimental sounds, with his 2019 album *Goodbye El Dorado* paying tribute to the Laurel Canyon singer-songwriter era.\n\n$25 adv + DICE fees / $30 at the door\n\nDoors at 8 PM",
    "workingText": "Presented by Healing Force of the Universe."
  }
]